CSI API ETABS v1
cPropPointSpring.GetPointSpringProp Method
 Retrieves an existing named point spring property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPointSpringProp(
	string Name,
	ref int SpringOption,
	ref double[] k,
	ref string CSys,
	ref string SoilProfile,
	ref string Footing,
	ref double Period,
	ref int color,
	ref string notes,
	ref string iGUID
)
Function GetPointSpringProp (
	Name As String,
	ByRef SpringOption As Integer,
	ByRef k As Double(),
	ByRef CSys As String,
	ByRef SoilProfile As String,
	ByRef Footing As String,
	ByRef Period As Double,
	ByRef color As Integer,
	ByRef notes As String,
	ByRef iGUID As String
) As Integer
Dim instance As cPropPointSpring
Dim Name As String
Dim SpringOption As Integer
Dim k As Double()
Dim CSys As String
Dim SoilProfile As String
Dim Footing As String
Dim Period As Double
Dim color As Integer
Dim notes As String
Dim iGUID As String
Dim returnValue As Integer
returnValue = instance.GetPointSpringProp(Name,
	SpringOption, k, CSys, SoilProfile,
	Footing, Period, color, notes, iGUID)
int GetPointSpringProp(
	String^ Name,
	int% SpringOption,
	array<double>^% k,
	String^% CSys,
	String^% SoilProfile,
	String^% Footing,
	double% Period,
	int% color,
	String^% notes,
	String^% iGUID
)
abstract GetPointSpringProp :
        Name : string *
        SpringOption : int byref *
        k : float[] byref *
        CSys : string byref *
        SoilProfile : string byref *
        Footing : string byref *
        Period : float byref *
        color : int byref *
        notes : string byref *
        iGUID : string byref -> int
Parameters
Name
Type: System.String
 The name of the point spring property
SpringOption
Type: System.Int32
 The spring stiffness option, either 1 or 2:
User Specified / Link Properties
Based on Soil Profile and Footing Dimensions
k
Type: System.Double[]
 This is an array of six spring stiffness values:
Value(0) = U1 [F/L]
Value(1) = U2 [F/L]
Value(2) = U3 [F/L]
Value(3) = R1 [FL/rad]
Value(4) = R2 [FL/rad]
Value(5) = R3 [FL/rad]
 This argument only applies when SpringOption = 1
CSys
Type: System.String
 The name of the coordinate system in which the property is defined.
 This argument only applies when SpringOption = 1
SoilProfile
Type: System.String
 The name of an existing Soil Profile
 This argument only applies when SpringOption = 2
Footing
Type: System.String
 The name of an existing Isolated Column Footing
 This argument only applies when SpringOption = 2
Period
Type: System.Double
 The first-mode time period [sec]
 This argument only applies when SpringOption = 2
color
Type: System.Int32
 The display color for the property specified as an integer
notes
Type: System.String
 The notes, if any, assigned to the property
iGUID
Type: System.String
 The GUID (global unique identifier), if any, assigned to the property
Return Value
Type: Int32
 Returns zero if the property is retrieved successfully, otherqwise returns nonzero
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
   ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new spring property
   Dim k() as Double
   ReDim k(5)
   k(2) = 1
   ret = SapModel.PropPointSpring.SetPointSpringProp("mySpringProp1", 1, k)
'get spring property
   Dim SpringOption As Integer
   Dim k1() As Double
   Dim CSys As String
   Dim SoilProfile As String
   Dim Footing As String
   Dim Period As Double
   Dim color As Integer
   Dim notes As String
   Dim iGuid As String
   ret = SapModel.PropPointSpring.GetPointSpringProp("mySpringProp1", SpringOption, k1, CSys, SoilProfile, Footing, Period, color, notes, iGuid)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cPropPointSpring Interface
ETABSv1 Namespace